/*=========================================================
				■■■ 연산자(Operator) ■■■
	비트 단위 연산자
	비트 쉬프트 연산자
=========================================================*/

public class Test025
{
	public static void main(String[] args)
	{
		int x = 128;		// 00000000 00000000 00000000 100000000

		System.out.printf("x << 3 : %d%n", x << 3);
		// 00000000 00000000 00000100 000000000
		System.out.printf("x * 8 : %d%n", x * 8);
		// → x << 3 : 1024
		//	  x * 8 : 1024

		System.out.printf("x >> 3 : %d%n", x >> 3);
		// 00000000 00000000 00000000 000100000
		System.out.printf("x / 8 : %d%n", x / 8);
		// → x >> 3 : 16
		//	  x / 8 : 16

		System.out.printf("x << 24 : %d%n", x << 24);
		// → x << 24 : -2147483648
		// 10000000 00000000 00000000 00000000		: 가장 앞이 1이 되면 음수

		System.out.printf("x << 25 : %d%n", x << 25);
		// → x << 25 : 0
		// 00000000 00000000 00000000 00000000		: 원래 1이 있던 자리 전까지는 숫자 잠복
		System.out.printf("x << %d%n", x << 32);
		// → x << 128
		// 00000000 00000000 00000000 000100000		: 처음 자리로 돌아왔기 때문에 1 표시

		// 최종 결과
		/*
			x << 3 : 1024
			x * 8 : 1024
			x >> 3 : 16
			x / 8 : 16
			x << 24 : -2147483648
			x << 25 : 0
			x << 128
			계속하려면 아무 키나 누르십시오 . . .
		*/
	}
}